{
  "info": {
    "firstName": "Alix",
    "lastName": "Quentin",
    "title": "Software Engineer / Tech Lead",
    "email": "alixquentin@pm.me",
    "github": "alxqtn"
  },
  "bio": "<p><b>Autodidacte passionnée</b> par la technologie, j'ai aujourd'hui <b>plus de six ans d'expérience</b> en développement full stack. Je me spécialise en <b>TypeScript, Node.js et React</b> mais j'aime explorer d'autres stacks régulièrement.</p><p>Je cherche désormais à mettre à profit mon expertise en programmation lors de <b>missions en freelance</b> auprès d'organisations qui oeuvrent pour des <b>causes sociales ou environnementales</b> et partagent mes valeurs.</p>",
  "i18n": {
    "current": "En Poste",
    "diplomas": "Diplômes",
    "skills": "Compétences",
    "experience": "Expériences",
    "languages": "Langues",
    "summary": "Profil"
  },
  "experiences": [
    {
      "title": "Senior Software Engineer",
      "company": "Lalilo",
      "startDate": "Mar 2021",
      "endDate": "Oct 2025",
      "achievements": [
        "Contribution au développement d'une plateforme éducative en participant à l'amélioration d'algorithmes d'apprentissage adaptatif, de fonctionnalités de rappel espacé et d'outils d'édition de contenu.",
        "Utilisation de TypeScript, React et Express pour implémenter des fonctionnalités full-stack, tout en gérant efficacement les données avec PostgreSQL.",
        "Maintenance de l'infrastructure cloud via Kubernetes, Terraform et les outils de surveillance Datadog.",
        "Collaboration au sein de l'équipe backend pour concevoir un système de traitement de tâches (jobs) et participer aux initiatives d'optimisation de nos serveurs et bases de données.",
        "Prise en charge des recrutements devs : mené des entretiens en pair programming, puis évolution vers la recherche de candidats (sourcing), la définition des rôles et la gestion globale des embauches de l'équipe.",
        "Migration et maintien de la couche API reliant nos produits aux modèles internes de reconnaissance vocale basés sur le machine learning, en utilisant Python, Flask et PostgreSQL.",
        "Participation à une taskforce destinée à explorer le potentiel des applications d'IA (générative, text-to-speech et autre) à travers des tests et des recherches.",
        "Nombreuses contributions à la rédaction d'une proposition dans le cadre d'un appel d'offres important, afin de satisfaire aux exigences d'architecture et aux spécifications techniques."
      ]
    },
    {
      "title": "Développeuse Web Fullstack",
      "company": "deliver.ee",
      "startDate": "Jul 2019",
      "endDate": "Fev 2021",
      "achievements": [
        "Création et développement en équipe, jusqu'à mise en production, d'un nouveau projet de gestion de plannings. Stack Elixir, Phoenix, GraphQL, React, Apollo.",
        "Résolution de bugs et développement de features sur un projet de gestion de livraisons. Stack Rails, Grape (API REST), Ember et Vue.",
        "Reprise d'une application mobile pour les livreurs. Stack React Native, Redux.",
        "Refonte complète d'un projet front de gestion de grilles tarifaires. Stack Vue, Vuex.",
        "Optimisation d'une suite de tests legacy Rspec-Rails : 40min &rArr; 5min.",
        "Conception, modélisation, puis rédaction de specs techniques, en collaboration avec le produit, pour l'évolution d'un projet legacy."
      ]
    },
    {
      "title": "Hôtesse d'Accueil en Entreprise",
      "company": "Charlestown, Par-s-on Assistance, A-SC",
      "startDate": "Jun 2013",
      "endDate": "Nov 2017",
      "achievements": []
    }
  ],
  "skills": [
    {
      "category": "Langages",
      "details": "Experte en JavaScript/TypeScript. Expériences pro avec Ruby, Elixir, Python. Bases solides en Go, Scala, Gleam, Rust, PHP."
    },
    {
      "category": "Backend",
      "details": "Experte en Node (Express, Koa). Explorations Bun/Deno. Maîtrise des frameworks MVC Rails et Phoenix, et de Flask/FastAPI."
    },
    {
      "category": "Front",
      "details": "Maîtrise HTML/CSS. Experte React, explorations avec Next, Remix, Astro, React Native. Maîtrise de Vue, explorations avec Solid, HTMX, Alpine."
    },
    {
      "category": "Bases de données",
      "details": "Maîtrise des bases SQL, particulièrement PostgreSQL. À l'aise Redis, MongoDB."
    },
    {
      "category": "DevOps",
      "details": "Maîtrise de Docker, Kubernetes, et des outils CI/CD comme Github Actions ou Circle CI. Expériences d'infrastructure déclarative avec Terraform et Terraform Cloud."
    },
    {
      "category": "Cloud",
      "details": "Maîtrise de l'écosystème AWS, connaissance des offres de Cloudflare, Vercel, Netlify, Railway, Digital Ocean."
    },
    {
      "category": "IA",
      "details": "À l'aise avec Claude Code, Copilot, Cursor. Bonne connaissance de l'écosystème, modèles, serveurs MCP, prompt engineering, intégrations API."
    }
  ],
  "diplomas": [
    {
      "title": "Licence de Sociologie et Anthropologie",
      "school": "Paris VII Diderot",
      "year": "2015"
    },
    {
      "title": "Certificate of Advanced English (CAE)",
      "school": "Cambridge",
      "year": "2012"
    }
  ],
  "languages": [
    {
      "name": "Français",
      "level": "Maternel",
      "align": "left"
    },
    {
      "name": "Anglais",
      "level": "Bilingue",
      "align": "center"
    },
    {
      "name": "Espagnol",
      "level": "Moyen",
      "align": "right"
    }
  ]
}
